---
kind: method
id: M:Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIData.Dispose
source: html/f7dd86b0-5351-7f71-f782-ee2a8921c17a.htm
---
# Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIData.Dispose Method

Releases all resources used by the PipeFittingAndAccessoryPressureDropUIData

## Syntax (C#)
```csharp
public void Dispose()
```